package Routes

import "github.com/gin-gonic/gin"

/*
CommentRoutes [评论路由接口] [V1.0] []
------------------------------------------------------------------------------------------------------------------------

	╒[需要授权] [authCommentAPI]
	╞═
	╞═
	╞═
	╘═

------------------------------------------------------------------------------------------------------------------------

	╒[不需要授权] [notAuthCommentAPI]
	╞═
	╞═
	╞═
	╞═
	╞═
	╘═

------------------------------------------------------------------------------------------------------------------------
*/
func CommentRoutes(router *gin.Engine) {
	comment := router.Group("api/Comment")
	{
		comment.GET("", func(c *gin.Context) {
			c.String(200, "hello-world")
		})
	}
}
